In [1]:
import matplotlib.pyplot as plt
import pandas as pd 
from sklearn import( 
    ensemble,
    preprocessing,
    tree,
)
from sklearn.metrics import (
    auc,
    confusion_matrix,
    roc_auc_score,
    roc_curve,
)
from sklearn.model_selection import (
    train_test_split,
    StratifiedKFold,
)
from yellowbrick.classifier import (
    ConfusionMatrix,
    ROCAUC,
)
from yellowbrick.model_selection import (
    LearningCurve,
)

In [2]:
from os import path

In [3]:
#Endereço do arquivo - independente do sistema ooperacional 
DIRETORIO_AVO = path.dirname(path.abspath('__file__'))
ENDERECA_ARQUIVO = path.join(DIRETORIO_AVO, 'dados', 'titanic.csv')

In [4]:
print(DIRETORIO_AVO)

C:\Users\pedro\OneDrive\Área de Trabalho\Titanic

In [5]:
df = pd.read_csv(ENDERECA_ARQUIVO)

In [6]:
df.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [8]:
df.describe().iloc[: , :2]

            pclass     survived
count  1309.000000  1309.000000
mean      2.294882     0.381971
std       0.837836     0.486055
min       1.000000     0.000000
25%       2.000000     0.000000
50%       3.000000     0.000000
75%       3.000000     1.000000
max       3.000000     1.000000

In [9]:
df.isnull().sum(axis=1).loc[:10]

0     1
1     1
2     2
3     1
4     2
5     1
6     1
7     2
8     1
9     2
10    1
dtype: int64

In [10]:
mascara =  df.isnull().any(axis=1) # A função any() verifica se  a algum item verdadeiro

In [11]:
mascara.head(10)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
dtype: bool

In [12]:
df[mascara].body.head()

0      NaN
1      NaN
2      NaN
3    135.0
4      NaN
Name: body, dtype: float64

In [13]:
df.sex.value_counts(dropna=False) # contando quantas vezes cada valor se repete da coluna sex

sex
male      843
female    466
Name: count, dtype: int64

In [14]:
df.embarked.value_counts(dropna=False) # contando quantas vezes cada valor se repete da coluna embarked

embarked
S      914
C      270
Q      123
NaN      2
Name: count, dtype: int64

In [15]:
df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [16]:
#descartando informações
df = df.drop(columns = [
            "name",
            "ticket",
            "home.dest",
            "boat",
            "body",
            "cabin",
        ]
)

In [17]:
df.head()

   pclass  survived     sex    age  sibsp  parch      fare embarked
0       1         1  female  29.00      0      0  211.3375        S
1       1         1    male   0.92      1      2  151.5500        S
2       1         0  female   2.00      1      2  151.5500        S
3       1         0    male  30.00      1      2  151.5500        S
4       1         0  female  25.00      1      2  151.5500        S

In [18]:
df =  pd.get_dummies(df)

In [19]:
df.columns

Index(['pclass', 'survived', 'age', 'sibsp', 'parch', 'fare', 'sex_female',
       'sex_male', 'embarked_C', 'embarked_Q', 'embarked_S'],
      dtype='object')

In [22]:
#removendo a coluna sex_male
df = df.drop(columns='sex_male')

In [23]:
df = pd.get_dummies(df, drop_first=True)

In [25]:
df.head(3)

,pclass,survived,age,sibsp,parch,fare,sex_female,embarked_C,embarked_Q,embarked_S
0,1,1,29.00,0,0,211.3375,True,False,False,True
1,1,1,0.92,1,2,151.5500,False,False,False,True
2,1,0,2.00,1,2,151.5500,True,False,False,True